org/notes/making_website.org
#+SETUPFILE: ../../org_templates/level-1.org

#+TITLE: Making this website

** [[file:~/Desktop/webpage/public_html/index.html][Home]] | [[file:~/Desktop/webpage/public_html/notes.html][Notes]] | [[file:~/Desktop/webpage/public_html/projects.html][Projects]] | [[file:~/Desktop/webpage/public_html/misc.html][Misc]]

--------

I wrote this page to document the process of creating this website.
I used Emacs Org-mode to generate the html syntax.
Here are two useful guides for it: 

- [[https://orgmode.org/worg/org-tutorials/org4beginners.html][Org-mode basics]]

- [[https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html][Org-mode publishing to HTML]]

These should be sufficient in terms of documentation, but I will add some details
which were helpful in dealing with the corner cases. 

- The setup files (level-0.org, level-1.org etc) described in the publishing tutorial 
  are the way to go for customization. They make the content org files much cleaner. 

- For specific and small css edits for example controlling size of images
  one can add '=#+ATTR_HTML: :height 50px :width 100%=' just on the line 
  above the image link.

- My css file is a slight modification from [[https://gist.github.com/killercup/5917178][this css]] file for pandoc markdown. I took 
  some elements from the [[https://edwardtufte.github.io/tufte-css/][tufte css]] page.

--------

