public_html/notes/making_website.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Making this website</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Making this website</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a href="file:///home/ninad/Desktop/webpage/public_html/index.html">Home</a> | <a href="file:///home/ninad/Desktop/webpage/public_html/notes.html">Notes</a> | <a href="file:///home/ninad/Desktop/webpage/public_html/projects.html">Projects</a> | <a href="file:///home/ninad/Desktop/webpage/public_html/misc.html">Misc</a></h2>
<div class="outline-text-2" id="text-1">
<hr  />

<p>
I wrote this page to document the process of creating this website.
I used Emacs Org-mode to generate the html syntax.
Here are two useful guides for it: 
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org/worg/org-tutorials/org4beginners.html">Org-mode basics</a>
</li>

<li><a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">Org-mode publishing to HTML</a>
</li>
</ul>

<p>
These should be sufficient in terms of documentation, but I will add some details
which were helpful in dealing with the corner cases. 
</p>

<ul class="org-ul">
<li>The setup files (level-0.org, level-1.org etc) described in the publishing tutorial 
are the way to go for customization. They make the content org files much cleaner. 
</li>

<li>For specific and small css edits for example controlling size of images
one can add '<code>#+ATTR_HTML: :height 50px :width 100%</code>' just on the line 
above the image link.
</li>

<li>My css file is a slight modification from <a href="https://gist.github.com/killercup/5917178">this css</a> file for pandoc markdown. I took 
some elements from the <a href="https://edwardtufte.github.io/tufte-css/">tufte css</a> page.
</li>
</ul>

<hr  />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><small> Created with <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</small></p>
<p class="validation"></p>
</div>
</body>
</html>
